# 3) შექმენით ცვლადი სადაც შეიტანთ string-ს და ეს სტრინგი უნდა გადააქციოთ ინტეჯერად და უნდა ახსნათ კომენტარებით რატო არ შეიძლება რომ ეს string-ი გადავაქციოთ ინტეჯერად

string = "akaki"

integer_string = int(string)
#string მონაცემთა ტიპი ვერ გახდება integer, რადგან integer მონაცემთა ტიპი არის მხოლოდ მთელი რიცხვები

### 44) ახსენით type ფუნქცია რას აკეთებს კომენტარებით და გააკეთეთ მაგალითებიც
#type ფუნქცია გვეუბნება რომელ მონაცემთა ტიპის მნიშვნელობას შეიცავს ცვლადი

#for example:
number = 5
print(type(number))

# terminall:  
# <class 'int'>


#### 5) გატესტეთ და ეს კოდი ახსენით კომენტარებით რას აკეთებს 
num1 = "10"
num2 = "10"
print(int(num1) + int(num2))

# გვაქვს ორი string ტიპის ცვლადი რომელსაც გადავაქცევთ integerad და print - ის საშუალებით ვუმატებთ
#რაც შედეგად ამმ ორი რიცხვის ჯამს გამოიტანს

#####6) ახსენით კომენტარებით რას ნიშნავს string, integer, float და გააკეთეთ რამოდენიმე მაგალითიც (edited)

# ყველა მონაცემი რომელიც მოქცეულია ბრჭყალებში " " სტრინგია 
name = "akaki"


# integer არის მთელი რიცხვი
num = 6


# float არის ათწილადი
num1 = 2.5

