#1   name = 6
#     ცვლადის პირველი სიმბოლო არ უნდა იყოს რიცხვი



# 3   my name = "akaki"
#     ცვლადის სახელი უნდა გამოიყოს  _ - ის საშუალებით 



# 4   print (name)
#     name = "akaki"
#     ჯერ უნდა შევქმნათ ცვლადი და შემოდგომ პრინტ ფუნქცია



# name = "akaki"
# last_name = "qartlelishvili"
# print(name + last_name)



#2) ახსენით debugger-ი რაარის კომენტარებით და გააკეთეთ ასევე მაგალითებიც
#  debugger ამოწმებს ჩვენს კოდს ეტაპობრივად


#3) შექმენით ცვლადი რომელიც იქნება name და მინიჭებული იქნება თქვენი სახელი და უნდა დაპრინტოთ ეს ცვლადი სწორი გზით და არასწორი გზით და უნდა ახსნათ კომენტარებით რატომ არის ეს გზა სწორი და რატომ არ არის ეს გზა სწორი

name = "akaki"
print(name)

# ეს არასწორია რადგან ჩვენი კოდი იკითხება ზემოდან ქვემოთ, შესაბამისად ჯერ უნდა იყოს ცვლადი და შემდეგ პრინტი
print(name)
name = "akaki"



#4) დაპრინტეთ GOA is the best academy in georgia სწორი გზით და არასწორი გზით და ახსენით კომენტარებით რატომ არის ეკ გზა სწორი და რატომ არ არის მეორე გზა სწორი
goa = "GOA is the best academy in georgia "
print(goa)



# ეს არასწორია რადგან ჩვენი კოდი იკითხება ზემოდან ქვემოთ, შესაბამისად ჯერ უნდა იყოს ცვლადი და შემდეგ პრინტი
print(goa)
goa = "GOA is the best academy in georgia "